Revit 2027 API
ElementRecord.GetBoundingBox Method
 Gets the bounding box of the element record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Outline GetBoundingBox()
Public Function GetBoundingBox As Outline
public:
Outline^ GetBoundingBox()
member GetBoundingBox : unit -> Outline
Return Value
Outline
 The bounding box outline. null if there is no bounding box for this element.
See Also
Reference
ElementRecord Class
Autodesk.Revit.DB Namespace